{
  "projectsData": [
    {
      "id": 1,
      "title": "Manifest",
      "description": "Bu site, geleneksel Türk rakı-balık kültürünü modern bir dijital deneyimle bir araya getirmek için tasarlanmıştır. React, HTML, CSS ve JavaScript kullanılarak geliştirilen site, lezzetli menülerimizi keşfetmenizi, rezervasyon yapmanızı ve restoranımız hakkında daha fazla bilgi edinmenizi sağlayan kullanıcı dostu bir arayüze sahiptir. Misafirlerimize denizden masaya taze ve unutulmaz bir deneyim sunmayı hedefliyoruz.",
      "image": "../assets/manifest-portfolio.png",
      "githubLink": "https://github.com/kurtemrecan/manifest",
      "siteLink": "https://www.manifestrestoran.com",
      "technologies": ["React", "JavaScript", "TailwindCss"]
    },
    {
      "id": 2,
      "title": "Pizza",
      "description": "Bu site, React ve Tailwind CSS kullanılarak modern bir tasarımla hazırlanmıştır ve lezzetli pizzalarımızı kolayca keşfetmenizi ve sipariş vermenizi sağlar. Kullanıcı dostu arayüzü sayesinde, pizza çeşitlerimizi inceleyebilir, istediğiniz lezzeti hızlıca sipariş edebilir ve size en yakın şubeyi bulabilirsiniz. Kaliteli malzemelerle ve taze tatlarla yapılan pizzalarımızı denemenizi sabırsızlıkla bekliyoruz!",
      "image": "../assets/bol-malzemos.png",
      "githubLink": "https://github.com/kurtemrecan/bol-malzemos",
      "siteLink": "https://bol-malzemos.vercel.app/",
      "technologies": ["React", "JavaScript", "TailwindCss"]
    },
    {
      "id": 3,
      "title": "Ürün Carousel'i",
      "description": "Bu JavaScript bileşeni, önerilen ürünleri gösteren duyarlı (responsive) bir ürün karuseli oluşturur. Favorilere ekleme, indirim göstergesi ve sepete ekleme gibi işlevler içerir. Verileri bir JSON uç noktasından (endpoint) çeker veya localStorage’daki önbelleğe alınmış verileri kullanır. Yatay bir kaydırıcı (slider) oluşturur; bu slider içinde gezinme düğmeleri ve ürün kartları bulunur. Ürün kartlarında görseller, fiyatlandırma ve etkileşimli öğeler yer alır. Bileşen, ana sayfa (root path) yüklendiğinde otomatik olarak başlatılır, kullanıcı etkileşimlerini kalıcı depolama ile yönetir ve farklı ekran boyutlarına uyum sağlayan tamamen duyarlı bir tasarım sunar.",
      "image": "../assets/product-carousel.png",
      "githubLink": "https://github.com/kurtemrecan/product-carousel-example",
      "siteLink": "https://product-carousel-example-t6og.vercel.app/",
      "technologies": ["JavaScript", "IIFE"]
    }
  ],
  "projects": "Projeler",
  "entry": "Yaratıcı düşünen, minimalizmi seven.",
  "heroAbout": "Merhaba, ben Emre Can Kurt. Ben bir full-stack geliştiricisiyim. Eğer sağlam ve ölçeklenebilir frontend ürünleri tasarlayacak bir geliştirici arıyorsanız, harika kullanıcı deneyimleri sunuyorum. Hadi el sıkışalım.",
  "skills": "Yetenekler",
  "skillsData": [
    {
      "name": "JavaScript",
      "description": "JavaScript, web sayfalarında dinamik içerikler oluşturmak için kullanılan güçlü bir programlama dilidir."
    },
    {
      "name": "React.Js",
      "description": "React, kullanıcı arayüzleri oluşturmak için kullanılan, bileşen tabanlı bir JavaScript kütüphanesidir."
    },
    {
      "name": "Node.Js",
      "description": "Node.js, sunucu tarafında JavaScript çalıştırmayı sağlayan bir platformdur. Yüksek performanslı uygulamalar geliştirmek için idealdir."
    },
    {
      "name": "VS Code",
      "description": "Visual Studio Code, yazılım geliştirme için popüler bir kod editörüdür. Kullanıcı dostu arayüzü ile pek çok uzantı desteği sunar."
    },
    {
      "name": "Redux",
      "description": "Redux, uygulama durumunu yönetmek için kullanılan bir kütüphanedir. Özellikle React uygulamaları ile birlikte yaygın olarak kullanılır."
    },
    {
      "name": "Figma",
      "description": "Figma, kullanıcı arayüzü tasarımı ve prototipleme için kullanılan çevrimiçi bir tasarım aracıdır. Ekiplerin birlikte çalışmasını kolaylaştırır."
    },
    {
      "name": "TailwindCss",
      "description": "Tailwind CSS, hızlı bir şekilde özelleştirilmiş kullanıcı arayüzleri oluşturmak için kullanılan bir CSS framework'üdür. Utility-first yaklaşımı ile dikkat çeker."
    }
  ],
  "hireme": "İşe Al",
  "wiewSite": "Siteyi Gör",
  "footerAbout": "Bir sonraki ürününüz üzerinde birlikte çalışalım",
  "profile": "Profil",
  "birthDate": "Doğum Tarihi",
  "residence": "İkamet",
  "education": "Eğitim Durumu",
  "role": "Rol",
  "aboutMe": "Hakkımda",
  "aboutMeValue": "Teknoloji ve yazılım geliştirme alanına tutkuluyum. Çeşitli projelerde edindiğim deneyimle, kullanıcı odaklı çözümler geliştirmeye ve verimliliği artırmaya odaklanıyorum. Yenilikçi fikirleri hayata geçirme konusundaki kararlılığım, ekip çalışmasına ve sürekli öğrenmeye olan tutkumla birleşiyor. Bağlantıda kalmayı ve deneyimlerimizi paylaşmayı dört gözle bekliyorum!",
  "birthDateValue": "30.08.1997",
  "residenceValue": "Adana",
  "educationValue": "Ege Ünv. Matematik ve Bilgisayar Bilimleri \n Lisans 2016",
  "roleValue": "Frontend, UI",
  "toastMail": "Mail adresine yönlendiriliyorsunuz!",
  "toastGithub": "Github'a yönlendiriliyorsunuz!",
  "toastLinkedin": "Linkedin'e yönlendiriliyorsunuz!",
  "ceviriBasarili": "Translate Success!"
}
